"""
Модуль для визначення станів (FSM), пов'язаних зі створенням та управлінням паті.
Це є стандартною практикою для підтримки чистоти коду та розділення відповідальності.
"""
from aiogram.fsm.state import StatesGroup, State


class PartyCreation(StatesGroup):
    """
    Стани для покрокового процесу створення нового лобі для пошуку команди.
    """
    confirm_creation = State()  # Стан очікування підтвердження (Так/Ні)
    select_role = State()       # Стан очікування вибору ролі ініціатором
